Перем КодУзла;

Функция ВыгрузитьУзел(Узел, Знач Уровень)

	Перем Элементы;

	Если НЕ ТипЗнч(Узел) = Тип("Структура") Тогда
		Если ТипЗнч(Узел) = Тип("Строка") Тогда
			Кавычки = """";
		Иначе
			Кавычки = "";
		КонецЕсли;
		Возврат Кавычки +  Узел + Кавычки + ";";
	КонецЕсли;

	Элементы = Уровень + "Новый Структура(""КодУзла, ";
	Запятая = "";
	Кавычка = "";
	Значения = "";
	Уровень = Уровень + " ";

	Для каждого Элемент Из Узел Цикл

			Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
				Кавычки = """";
			Иначе
				Кавычки = "";
			КонецЕсли;
			Элементы = Элементы + Кавычка + Запятая + Элемент.Ключ;
			Если ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
				Значения = Значения + Запятая + Символы.ПС + ВыгрузитьУзел(Элемент.Значение, Уровень) + Символы.ПС + Уровень + ")";
			Иначе
				Значение = Элемент.Значение;
				Если Значение = Неопределено Тогда
					Значение = "Неопределено";
				КонецЕсли;
				Значения = Значения + Запятая + Символы.ПС + Уровень + Кавычки +  Значение + Кавычки;
			КонецЕсли;
			Запятая = ", ";
			Кавычка = "";

	КонецЦикла;

	Если НЕ Значения = "" Тогда
		Элементы = Элементы + """," + КодУзла + ", " + Значения;
		КодУзла = КодУзла + 1;
	КонецЕсли;

	Возврат Элементы;

КонецФункции // ВыгрузитьУзел()


Функция СтруктуруВСтрокуВнутр(Объект)

	ДанныеЗаг = "";
	ДанныеТело = "";

	Для каждого элОбъект Из Объект Цикл
		ДанныеЗаг = ДанныеЗаг + "
		|Перем " +  элОбъект.Ключ + " Экспорт;";
		ДанныеТело = ДанныеТело + "
		|" + элОбъект.Ключ + " = " + ВыгрузитьУзел(элОбъект.Значение, "") + "
		|);";
	КонецЦикла;

	Возврат ДанныеЗаг + ДанныеТело;

КонецФункции // СтруктуруВСтрокуВнутр()

ПодключитьСценарий("src/Кожура/Ext/ObjectModule.bsl", "Кожура");

КодУзла = 0;

Кожура = Новый Кожура;
ЧтениеТекста = Новый ЧтениеТекста("test.jur", "UTF-8");
Исходник = ЧтениеТекста.Прочитать();

Парсер = Кожура.Парсер(Исходник);
Список = Кожура.Разобрать(Парсер);

FormResult = Новый ТекстовыйДокумент;
FormResult.SetText(СтруктуруВСтрокуВнутр(Новый Структура("Данные", Список)));
FormResult.Записать("datalisp.os");

//Сообщить(Кожура.Пуск(Исходник));
